Repository: giellalt/corpus-nob
Catalog: stable/tmx/sme/science/uit/master/kari_marlene_mulder_nob.pdf.tmx
Source language: nob
Languages: sme

source: Sammendrag
sme: Čoahkkáigeassu

source: Denne casestudien undersøker hvordan tospråklige elever som snakker nordsamisk og norsk bruker begge språkene i samtaler rundt naturfaglige begreper.
sme: Dát casedutkamuš iská movt guovttegielat oahppit geat hálddašit davvisámegiela ja dárogiela geavahit goappaš gielaid go ságastallat luonddufága doahpagiid birra.

source: Casene i studien er to elevgrupper fra ungdomsskole og videregående skole.
sme: Case:t leat guokte ohppiidjoavkku nuoraidskuvllas ja joatkkaskuvllas.

source: Formålet var å finne ut hvilke språklige praksiser elevene bruker, og hvordan de to språkene brukes for å søke etter eller uttrykke begrepsforståelse.
sme: Ulbmilin lei gávnnahit makkár gielalaš praksisat ohppiin leat, ja movt sii geavahit guokte giela go ohcalit dahje čájehit ipmárdusa luonddufága doahpagiin.

source: Studien er forankret i sosiokulturell læringsteori.
sme: Dutkamuša vuođus lea sosiokultuvrralaš oahppanteoriija.

source: Litteratur om læring av naturfagspråk, samt litteratur om tospråklighet og transspråking, utgjør det teoretiske rammeverket.
sme: Teorehtalaš rámma lea litteratuvra luonddufága giela oahppama birra, ja guovttegielatvuođa ja translanguaging birra.

source: Studien har en kvalitativ tilnærming der to elevgrupper med totalt syv elever ble observert i deres naturfagtimer.
sme: Dán casedutkamušas lea kvalitatiiva lahkoneapmi, ja mun lean áican luonddufágadiimmuin guokte ohppiidjoavkku main ledje oktiibuot čieža oahppi.

source: Lydopptak fra observasjonene ble transkribert og dannet utgangspunktet for en deskriptiv analyse.
sme: Jietna báddejuvvui ja deskriptiiva analysa vuođđun leat transkriberejuvvon báddemat.

source: Resultatene viser at elevene brukte kun samisk, kun norsk eller transspråklige praksiser i samtalene rundt naturfaglige begreper.
sme: Bohtosat čájehit ahte oahppit geavahedje dušše sámegiela, dušše dárogiela ja translanguaging go ságastalle luonddufága doahpagiid birra.

source: Norske ord for naturfaglige begreper ble ofte brukt i samtalene på samisk.
sme: Sii geavahedje dávjá dárogielat sániid luonddufága doahpagiidda go ságastalle sámegillii.

source: Lærerens og lærebokas språk påvirket elevenes språklige praksiser, og det er en tendens til at norske ord oftest ble brukt for begreper med et høyt taksonomisk nivå og stor avstand til hverdagsspråket.
sme: Oahpaheaddji ja oahppogirjji giella váikkuhii ohppiid gielalaš praksisiid, ja orrot adnome eambbo dárogielat sánit go doahpagiin lea alla taksonomalaš dássi dahje leat guhkkin eret sámegiel beaivválaš gielas.

source: Uansett om elevene brukte norske eller samiske ord for naturfaglige begreper, brukte de samisk for å diskutere meningsinnholdet i begreper.
sme: Beroškeahttá das geavahedje go oahppit sámegiel- dahje dárogielsániid doahpagiidda, de sii ságastalle doahpagiid sisdoalu birra sámegillii.

source: Elevene vekslet fleksibelt mellom språkene og transspråking ser ikke ut til å ha hindret begrepsforståelse.
sme: Sii lonohalle njuovžilit gielaid gaskkas, ja translanguaging ii orron hehtteme doahpagiid ipmirdeames.
